yelp_clone/app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KFC"], ["created_at", "2016-03-01 13:49:26.473954"], ["updated_at", "2016-03-01 13:49:26.473954"]]
---
	def create
		Restaurant.create(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
---
	def show
		@restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 15]]
---
	def edit
		@restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 19]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "Kentucky Fried Chicken"], ["updated_at", "2016-03-01 21:25:14.595397"], ["id", 19]]
---
	def update
		@restaurant = Restaurant.find(params[:id])
		@restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 34]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 34]]
---
	def destroy
		@restaurant = Restaurant.find(params[:id])
		@restaurant.destroy